node {
  name: "train_inputs"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
        dim {
          size: 28
        }
        dim {
          size: 28
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "train_labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
        dim {
          size: 10
        }
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5374838709831238
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/mul"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Assign"
  op: "Assign"
  input: "train_network/conv/conv2d/kernel"
  input: "train_network/conv/conv2d/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/read"
  op: "Identity"
  input: "train_network/conv/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "train_network/conv/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/conv/conv2d/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "train_network/conv/conv2d/kernel/Regularizer/l2_regularizer/scale"
  input: "train_network/conv/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/conv/conv2d/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/conv/conv2d/bias/Assign"
  op: "Assign"
  input: "train_network/conv/conv2d/bias"
  input: "train_network/conv/conv2d/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/conv/conv2d/bias/read"
  op: "Identity"
  input: "train_network/conv/conv2d/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/conv/conv2d/bias"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/conv/conv2d/Conv2D"
  op: "Conv2D"
  input: "train_inputs"
  input: "train_network/conv/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/conv/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "train_network/conv/conv2d/Conv2D"
  input: "train_network/conv/conv2d/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/beta/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_0/beta"
  input: "train_network/resblock0_0/batch_norm_0/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/beta/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_0/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/beta"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/gamma/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_0/gamma"
  input: "train_network/resblock0_0/batch_norm_0/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/gamma/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_0/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/gamma"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_mean/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_0/moving_mean"
  input: "train_network/resblock0_0/batch_norm_0/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_mean/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_0/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_mean"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_variance/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_0/moving_variance"
  input: "train_network/resblock0_0/batch_norm_0/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/moving_variance/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_0/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_variance"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "train_network/conv/conv2d/BiasAdd"
  input: "train_network/resblock0_0/batch_norm_0/gamma/read"
  input: "train_network/resblock0_0/batch_norm_0/beta/read"
  input: "train_network/resblock0_0/batch_norm_0/Const"
  input: "train_network/resblock0_0/batch_norm_0/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/sub"
  op: "Sub"
  input: "train_network/resblock0_0/batch_norm_0/moving_mean/read"
  input: "train_network/resblock0_0/batch_norm_0/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/mul"
  op: "Mul"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/sub"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg"
  op: "AssignSub"
  input: "train_network/resblock0_0/batch_norm_0/moving_mean"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "train_network/resblock0_0/batch_norm_0/moving_variance/read"
  input: "train_network/resblock0_0/batch_norm_0/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/sub"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1"
  op: "AssignSub"
  input: "train_network/resblock0_0/batch_norm_0/moving_variance"
  input: "train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_0/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_0/Identity"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_0/FusedBatchNormV3"
  input: "^train_network/resblock0_0/batch_norm_0/AssignMovingAvg"
  input: "^train_network/resblock0_0/batch_norm_0/AssignMovingAvg_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/Relu"
  op: "Relu"
  input: "train_network/resblock0_0/batch_norm_0/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09501461684703827
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/mul"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/read"
  op: "Identity"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Regularizer/l2_regularizer/scale"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/bias/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/conv_0/conv2d/bias"
  input: "train_network/resblock0_0/conv_0/conv2d/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/bias/read"
  op: "Identity"
  input: "train_network/resblock0_0/conv_0/conv2d/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_0/conv2d/bias"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/Conv2D"
  op: "Conv2D"
  input: "train_network/resblock0_0/Relu"
  input: "train_network/resblock0_0/conv_0/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_0/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "train_network/resblock0_0/conv_0/conv2d/Conv2D"
  input: "train_network/resblock0_0/conv_0/conv2d/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/beta/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_1/beta"
  input: "train_network/resblock0_0/batch_norm_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/beta/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/beta"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/gamma/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_1/gamma"
  input: "train_network/resblock0_0/batch_norm_1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/gamma/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/gamma"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_mean/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_1/moving_mean"
  input: "train_network/resblock0_0/batch_norm_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_mean/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_mean"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_variance/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/batch_norm_1/moving_variance"
  input: "train_network/resblock0_0/batch_norm_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/moving_variance/read"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_variance"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "train_network/resblock0_0/conv_0/conv2d/BiasAdd"
  input: "train_network/resblock0_0/batch_norm_1/gamma/read"
  input: "train_network/resblock0_0/batch_norm_1/beta/read"
  input: "train_network/resblock0_0/batch_norm_1/Const"
  input: "train_network/resblock0_0/batch_norm_1/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/sub"
  op: "Sub"
  input: "train_network/resblock0_0/batch_norm_1/moving_mean/read"
  input: "train_network/resblock0_0/batch_norm_1/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/mul"
  op: "Mul"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/sub"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg"
  op: "AssignSub"
  input: "train_network/resblock0_0/batch_norm_1/moving_mean"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "train_network/resblock0_0/batch_norm_1/moving_variance/read"
  input: "train_network/resblock0_0/batch_norm_1/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/sub"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1"
  op: "AssignSub"
  input: "train_network/resblock0_0/batch_norm_1/moving_variance"
  input: "train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/batch_norm_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/resblock0_0/batch_norm_1/Identity"
  op: "Identity"
  input: "train_network/resblock0_0/batch_norm_1/FusedBatchNormV3"
  input: "^train_network/resblock0_0/batch_norm_1/AssignMovingAvg"
  input: "^train_network/resblock0_0/batch_norm_1/AssignMovingAvg_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/Relu_1"
  op: "Relu"
  input: "train_network/resblock0_0/batch_norm_1/Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09501461684703827
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/mul"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Assign"
  op: "Assign"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/read"
  op: "Identity"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-05
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Regularizer/l2_regularizer/scale"
  input: "train_network/resblock0_0/conv_1/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/resblock0_0/conv_1/conv2d/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/resblock0_0/conv_1/conv2d/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
