node {
  name: "train_inputs"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
        dim {
          size: 28
        }
        dim {
          size: 28
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\001\000\000\000\030\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1632993221282959
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1632993221282959
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/max"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/RandomUniform"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/mul"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/Assign"
  op: "Assign"
  input: "train_network/init_block/conv_bn_relu/Conv/weights"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/weights/read"
  op: "Identity"
  input: "train_network/init_block/conv_bn_relu/Conv/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/Conv/Conv2D"
  op: "Conv2D"
  input: "train_inputs"
  input: "train_network/init_block/conv_bn_relu/Conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 24
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/beta/Assign"
  op: "Assign"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/beta"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/beta/read"
  op: "Identity"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 24
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 24
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 24
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/mean"
  op: "Mean"
  input: "train_network/init_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/StopGradient"
  op: "StopGradient"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "train_network/init_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/variance/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/variance"
  op: "Mean"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/SquaredDifference"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/variance/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  op: "Squeeze"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  op: "Squeeze"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean/read"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/sub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg"
  op: "AssignSub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance/read"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/sub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/init_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add"
  op: "Add"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/mul"
  op: "Mul"
  input: "train_network/init_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/mul_1"
  op: "Mul"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/sub"
  op: "Sub"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/beta/read"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add_1"
  op: "Add"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/mul"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/conv_bn_relu/BatchNorm/Relu"
  op: "Relu"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/init_block/MaxPool2D/MaxPool"
  op: "MaxPool"
  input: "train_network/init_block/conv_bn_relu/BatchNorm/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\030\000\000\000:\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.27050089836120605
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.27050089836120605
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/max"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/RandomUniform"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 24
        }
        dim {
          size: 58
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Assign"
  op: "Assign"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/read"
  op: "Identity"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/Conv2D"
  op: "Conv2D"
  input: "train_network/init_block/MaxPool2D/MaxPool"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 58
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 58
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta/Assign"
  op: "Assign"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta/read"
  op: "Identity"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 58
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 58
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean/Assign"
  op: "Assign"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean/read"
  op: "Identity"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 58
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 58
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance/Assign"
  op: "Assign"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance/read"
  op: "Identity"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/mean"
  op: "Mean"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/StopGradient"
  op: "StopGradient"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/variance/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/variance"
  op: "Mean"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/SquaredDifference"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/variance/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  op: "Squeeze"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  op: "Squeeze"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean/read"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg"
  op: "AssignSub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance/read"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1"
  op: "AssignSub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add"
  op: "Add"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze_1"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/mul"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/Conv/Conv2D"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/mul_1"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/moments/Squeeze"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/Rsqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/sub"
  op: "Sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/beta/read"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add_1"
  op: "Add"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/Relu"
  op: "Relu"
  input: "train_network/shuffle_block_0/shuffle_v2_block/conv_bn_relu/BatchNorm/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000:\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10629880428314209
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10629880428314209
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/max"
  input: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
}
node {
  name: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/RandomUniform"
  input: "train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_network/shuffle_block_0/shuffle_v2_block/depthwise_conv_bn/SeparableConv2d/depthwise_weights"
      }
    }
  }
}
node {
